pub fn score_to_rank(score: i64) -> &'static str {
    match score {
        400..9999999 => {"Надмозг"}
        300..400 => {"Ходячая википедия"}
        240..300 => {"Сверхразум"}
        200..240 => {"Интеллектуал"}
        150..200 => {"Учится в 12 классе"}
        90..150 => {"Задрот"}
        40..90 => {"Знаете, и сам своего рода учёный"}
        10..40 => {"Полторы извилины"}
        0..10 => {"Хлеп"}
        -10..0 => {"Майн"}
        -40..-10 => {" Дотер"}
        -90..-40 => {"♂DEEP ♂ DARK ♂ FANTASY♂"}
        -150..-90 => {"♂DUNGEON♂ ♂MASTER♂"}
        -200..-150 => {"♂BOSS OF THE GYM♂"}
        -240..-200 => {"♂Олег♂"}
        -300..-240 => {"♂THREE HUNDRED BUCKS♂"}
        -400..-300 => {"Наша Игра"}
        _ => {"MISSINGNO"}
    }
}